In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn import preprocessing
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score
from sklearn.metrics import confusion_matrix

In [2]:
dataset = pd.read_csv("train25.csv")

In [3]:
le= preprocessing.LabelEncoder()
le.fit(dataset["Sex"])

LabelEncoder()

In [4]:
print(le.classes_)

['female' 'male']

In [5]:
dataset["Sex"] = le.transform(dataset["Sex"])

In [6]:
le.fit(dataset["Embarked"])
dataset["Embarked"] = le.transform(dataset["Embarked"])

In [7]:
dataset.head()

   PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0            1         0       3    1  22.0      1      0   7.2500         2
1            2         1       1    0  38.0      1      0  71.2833         0
2            3         1       3    0  26.0      0      0   7.9250         2
3            4         1       1    0  35.0      1      0  53.1000         2
4            5         0       3    1  35.0      0      0   8.0500         2

In [8]:
from sklearn import neighbors

In [9]:
y = dataset["Pclass"]
X = dataset.drop(["Pclass", "PassengerId"], axis =1)

In [10]:
x_train, X_test, y_train, y_test = train_test_split(X,y,test_size = 0.3, random_state=0)

In [11]:
x_train.head()

     Survived  Sex   Age  SibSp  Parch     Fare  Embarked
350         0    1  45.0      0      0  35.0000         2
124         1    1  12.0      1      0  11.2417         0
577         0    0  45.0      1      0  14.4583         0
422         0    0  28.0      1      1  14.4000         2
118         0    0   2.0      4      2  31.2750         2

In [12]:
X_test.head()

     Survived  Sex   Age  SibSp  Parch      Fare  Embarked
14          0    0  14.0      0      0    7.8542         2
158         0    1  45.0      8      2   69.5500         2
762         1    0  36.0      1      2  120.0000         2
740         0    1  36.0      1      0   78.8500         2
482         1    0  63.0      0      0    9.5875         2

In [13]:
y_train.head()

350    1
124    3
577    3
422    3
118    3
Name: Pclass, dtype: int64

In [14]:
y_test.head()

14     3
158    3
762    1
740    1
482    3
Name: Pclass, dtype: int64

In [15]:
knn = neighbors.KNeighborsClassifier(n_neighbors=3)

In [16]:
knn.fit(x_train,y_train).score(X_test, y_test)

0.8651685393258427

In [17]:
ypred = knn.predict(X_test)

In [18]:
confusion_matrix(y_test,ypred)

array([[ 63,   5,   2],
       [  7,  28,  14],
       [  3,   5, 140]], dtype=int64)